#Завдання 1

puts "Вітаю. Це тест який ти пельмешек. Як тебе звати?"
name = gets.chomp
puts "Привіт, #{name}"

result = 0

puts "Ну от припустимо ви йдете по офісу, ви дуже голодні і раптом відчуваєте запах пельмешок, які їсть ваш друг. Ваші події?"
puts "1 Скажу йому, щоб йшов звідци зі своїми пельменями і не бентежив мене"
puts "2 Скажу «приємного апетиту» і сумно дивитимусь"
puts "3 Це якось стрімко, просити їжу, я б посоромився"
puts "4 Розуміючи, що його порція є досить великою, попрошу його поділитися"
a1=gets.chomp.to_i
result+=a1

puts "Ну от припустимо у вас у морозилці лежить заначка з пельмешками, але коли ви вирішили її розчехлити, то виявили, що вас хтось випередив. Ваші події?"
puts "1 Тупо дивитимуся на дверцята холодильника і думатиму, що б ще з'їсти"
puts "2 Знайду винного і прошу вибачитися"
puts "3 Можу і розплакатися"
puts "4 Не зациклюватимусь, пельмешки вже не повернути"
a2=gets.chomp.to_i
result+=a2

puts "Ну от припустимо ви володієте заводом з виробництва пельмешок і до вас прийшли віджати бізнес. Ваші події?"
puts "1 Пущу їх самих на пельмені"
puts "2 Благатиму не чіпати мене, а потім здам у поліцію"
puts "3 Прикидаюсь пельменем"
puts "4 Спробую відкупитись пельменями"
a3=gets.chomp.to_i
result+=a3

if result == 3
    puts "Ти вареник"
elsif result >= 4 and result <= 6
    puts "Ти хінкалі"
elsif result >=7 and result <= 12
    puts "Ти равіолі"
else
    puts "Ти пельмень з іншої планети. Щось незрозуміле у твоїх відповідях."
end

#Завдання 2

day = 14
month = 10

day *=2
day +=5
day *=50
day += month
day -= 250

puts day