# завдання 1

s = 3 * 3 * 3
puts "Найменшу армію у світі (#{s} осіб) має республіка Сан-Марино."

l = 77 / 11
puts "Не важливо, наскільки великий ви взяли паперовий лист, понад #{l} разів ви все одно його не складете навпіл."

j = (26 % 3) * 100
puts "У Японії є банкомати, які перед видачею нагрівають банкноти до #{j} °С, щоби дезінфікувати їх."

# завдання 2

write = 83 / 17
puts "На скільки більше людей, які вміють писати, ніж тих, хто не вміє?. На #{write}."

language = 12 / 2
puts "У скільки разів більше людей говорять китайською, ніж японською?. У #{language} разів."

language2 = 5 + 8
puts "Скільки всього людей говорять англійською або іспанською? #{language2}."